In [7]:
import pandas as pd
data = pd.DataFrame({
    "Student": ["A", "A", "B", "B"],
    "Subject": ["Math", "Science", "Math", "Science"],
    "Marks": [80, 85, 75, 90]
})
print(data)
pivot_table = data.pivot(index="Student", columns="Subject", values="Marks")
print(pivot_table)

  Student  Subject  Marks
0       A     Math     80
1       A  Science     85
2       B     Math     75
3       B  Science     90
Subject  Math  Science
Student
A          80       85
B          75       90

In [8]:
melted = data.melt(
    id_vars=["Student"],
    value_vars=["Subject", "Marks"],
    var_name="Type",
    value_name="Value"
)
print(melted)

  Student     Type    Value
0       A  Subject     Math
1       A  Subject  Science
2       B  Subject     Math
3       B  Subject  Science
4       A    Marks       80
5       A    Marks       85
6       B    Marks       75
7       B    Marks       90

In [9]:
data = {
    "Number": ["one", "two", "three"]
}
states = ["Ohio", "Colorado", "Texas"]
df = pd.DataFrame(data, index=states)
df.index.name = "States"
print(df)

         Number
States
Ohio        one
Colorado    two
Texas     three

In [10]:
import numpy as np
import pandas as pd

data = pd.DataFrame(
    np.arange(6).reshape((2, 3)),
    index=pd.Index(['ohio', 'colorado'], name='state'),
    columns=pd.Index(['one', 'two', 'three'], name='number')
)

print(data)
result = data.stack()
result
result.unstack()

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [11]:
# Fixed cell
df = pd.DataFrame({'key':['foo','bar','baz'],'A':[1,2,3],'B':[4,5,6],'c':[7,8,9]})
df

   key  A  B  c
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [12]:
df = pd.DataFrame({'key':['foo','bar','baz'],'A':[1,2,3],'B':[4,5,6],'c':[7,8,9]})
df
melted=pd.melt(df,['key'])
melted
pd.melt(df,id_vars=['key'],value_vars=['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [16]:
pivoted = melted.pivot(index='key', columns='variable', values='value')
pivoted

variable  A  B  c
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [34]:
import pandas as pd
import numpy as np
data=pd.Series(["a","b","c",np.nan,"e", np.nan])
data
data.isnull()
data.isnull().sum()
print(data.isnull().sum())

2

In [40]:
data1=pd.DataFrame({"C1":["a","b","c",np.nan,"e"],"C2":[1,np.nan,3,4,np.nan],"C3":[np.nan,2,3,4,np.nan]})
data1
data1.isnull()
data1.isnull().sum()
print(data1.isnull().sum())
cleaned= data1.dropna()
cleaned

C1    1
C2    2
C3    2
dtype: int64

  C1   C2   C3
2  c  3.0  3.0

In [50]:
data1=pd.DataFrame({"C1":["a","b","c",np.nan,"e"],"C2":[1,np.nan,3,4,np.nan],"C3":[np.nan,2,3,4,np.nan]})
data1
cleaned1=data1.dropna(axis=1)
cleaned1
cleaned1=data1.dropna(thresh=1)
cleaned1

    C1   C2   C3
0    a  1.0  NaN
1    b  NaN  2.0
2    c  3.0  3.0
3  NaN  4.0  4.0
4    e  NaN  NaN

In [91]:
data3=pd.DataFrame({
    "C1":["a","b","c",np.nan,"e"],
    "C2":[1,np.nan,3,4,np.nan],
    "C3":[np.nan,2,3,4,np.nan],
    "C4":[np.nan,np.nan,np.nan,np.nan,np.nan]})
data3
data3.dropna(how="all",inplace=True)
cleaned=data1.dropna(axis=0)
cleaned
cleaned=data1.dropna(thresh=3)
cleaned1
df.fillna(0)
df.fillna({'0':"1","1":"2","2":"3","3":"0"})

data3.fillna(method="ffill", limit=2)
data3

C:\Users\rt855\AppData\Local\Temp\ipykernel_19520\650632025.py:15: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data3.fillna(method="ffill", limit=2)

    C1   C2   C3  C4
0    a  1.0  NaN NaN
1    b  NaN  2.0 NaN
2    c  3.0  3.0 NaN
3  NaN  4.0  4.0 NaN
4    e  NaN  NaN NaN

In [84]:
data3.fillna(method="ffill", limit=2)

C:\Users\rt855\AppData\Local\Temp\ipykernel_19520\3484296289.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data3.fillna(method="ffill", limit=2)

  C1   C2   C3  C4
0  a  1.0  NaN NaN
1  b  1.0  2.0 NaN
2  c  3.0  3.0 NaN
3  c  4.0  4.0 NaN
4  e  4.0  4.0 NaN

In [6]:
import pandas as pd
character = ['a','b','c','d']
cat_c=pd.series(character)
cat_c = c.astype('category')
cat_c
print(cat_c)

AttributeError: module 'pandas' has no attribute 'series'